name: "test"
layer {
  name: "data"
  type: "MemoryData"
  top: "data"
  top: "label"
  memory_data_param {
    batch_size: 1
    channels: 3
    height: 256
    width: 256
  }
}
layer {
  name: "conv01_data1_a"
  type: "Convolution"
  bottom: "data"
  top: "conv01_data1_a"
  convolution_param {
    num_output: 32
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.025253814
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv01_data1_b"
  type: "Convolution"
  bottom: "data"
  top: "conv01_data1_b"
  convolution_param {
    num_output: 32
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.025253814
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv01_data1"
  type: "Eltwise"
  bottom: "conv01_data1_a"
  bottom: "conv01_data1_b"
  top: "conv01_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "pool0_data1"
  type: "Pooling"
  bottom: "conv01_data1"
  top: "pool0_data1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv11_data1_a"
  type: "Convolution"
  bottom: "pool0_data1"
  top: "conv11_data1_a"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.058925565
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv11_data1_b"
  type: "Convolution"
  bottom: "pool0_data1"
  top: "conv11_data1_b"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.058925565
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv11_data1"
  type: "Eltwise"
  bottom: "conv11_data1_a"
  bottom: "conv11_data1_b"
  top: "conv11_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv12_data1_a"
  type: "Convolution"
  bottom: "conv11_data1"
  top: "conv12_data1_a"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.058925565
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv12_data1_b"
  type: "Convolution"
  bottom: "conv11_data1"
  top: "conv12_data1_b"
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.058925565
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv12_data1"
  type: "Eltwise"
  bottom: "conv12_data1_a"
  bottom: "conv12_data1_b"
  top: "conv12_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv13_data1_a"
  type: "Convolution"
  bottom: "conv12_data1"
  top: "conv13_data1_a"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.041666668
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv13_data1_b"
  type: "Convolution"
  bottom: "conv12_data1"
  top: "conv13_data1_b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.041666668
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv13_data1"
  type: "Eltwise"
  bottom: "conv13_data1_a"
  bottom: "conv13_data1_b"
  top: "conv13_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv14_data1_a"
  type: "Convolution"
  bottom: "conv13_data1"
  top: "conv14_data1_a"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.041666668
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv14_data1_b"
  type: "Convolution"
  bottom: "conv13_data1"
  top: "conv14_data1_b"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.041666668
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv14_data1"
  type: "Eltwise"
  bottom: "conv14_data1_a"
  bottom: "conv14_data1_b"
  top: "conv14_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "pool1_data1"
  type: "Pooling"
  bottom: "conv14_data1"
  top: "pool1_data1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv21_data1_a"
  type: "Convolution"
  bottom: "pool1_data1"
  top: "conv21_data1_a"
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.034020692
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv21_data1_b"
  type: "Convolution"
  bottom: "pool1_data1"
  top: "conv21_data1_b"
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.034020692
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv21_data1"
  type: "Eltwise"
  bottom: "conv21_data1_a"
  bottom: "conv21_data1_b"
  top: "conv21_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv22_data1_a"
  type: "Convolution"
  bottom: "conv21_data1"
  top: "conv22_data1_a"
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.034020692
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv22_data1_b"
  type: "Convolution"
  bottom: "conv21_data1"
  top: "conv22_data1_b"
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.034020692
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv22_data1"
  type: "Eltwise"
  bottom: "conv22_data1_a"
  bottom: "conv22_data1_b"
  top: "conv22_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv23_data1_a"
  type: "Convolution"
  bottom: "conv22_data1"
  top: "conv23_data1_a"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.029462783
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv23_data1_b"
  type: "Convolution"
  bottom: "conv22_data1"
  top: "conv23_data1_b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.029462783
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv23_data1"
  type: "Eltwise"
  bottom: "conv23_data1_a"
  bottom: "conv23_data1_b"
  top: "conv23_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv24_data1_a"
  type: "Convolution"
  bottom: "conv23_data1"
  top: "conv24_data1_a"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.029462783
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv24_data1_b"
  type: "Convolution"
  bottom: "conv23_data1"
  top: "conv24_data1_b"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.029462783
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv24_data1"
  type: "Eltwise"
  bottom: "conv24_data1_a"
  bottom: "conv24_data1_b"
  top: "conv24_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv25_data1_a"
  type: "Convolution"
  bottom: "conv24_data1"
  top: "conv25_data1_a"
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.026352314
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv25_data1_b"
  type: "Convolution"
  bottom: "conv24_data1"
  top: "conv25_data1_b"
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.026352314
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv25_data1"
  type: "Eltwise"
  bottom: "conv25_data1_a"
  bottom: "conv25_data1_b"
  top: "conv25_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv26_data1_a"
  type: "Convolution"
  bottom: "conv25_data1"
  top: "conv26_data1_a"
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.026352314
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv26_data1_b"
  type: "Convolution"
  bottom: "conv25_data1"
  top: "conv26_data1_b"
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.026352314
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv26_data1"
  type: "Eltwise"
  bottom: "conv26_data1_a"
  bottom: "conv26_data1_b"
  top: "conv26_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "pool2_data1"
  type: "Pooling"
  bottom: "conv26_data1"
  top: "pool2_data1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv31_data1_a"
  type: "Convolution"
  bottom: "pool2_data1"
  top: "conv31_data1_a"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv31_data1_b"
  type: "Convolution"
  bottom: "pool2_data1"
  top: "conv31_data1_b"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv31_data1"
  type: "Eltwise"
  bottom: "conv31_data1_a"
  bottom: "conv31_data1_b"
  top: "conv31_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv32_data1_a"
  type: "Convolution"
  bottom: "conv31_data1"
  top: "conv32_data1_a"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv32_data1_b"
  type: "Convolution"
  bottom: "conv31_data1"
  top: "conv32_data1_b"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv32_data1"
  type: "Eltwise"
  bottom: "conv32_data1_a"
  bottom: "conv32_data1_b"
  top: "conv32_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv33_data1_a"
  type: "Convolution"
  bottom: "conv32_data1"
  top: "conv33_data1_a"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv33_data1_b"
  type: "Convolution"
  bottom: "conv32_data1"
  top: "conv33_data1_b"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv33_data1"
  type: "Eltwise"
  bottom: "conv33_data1_a"
  bottom: "conv33_data1_b"
  top: "conv33_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv34_data1_a"
  type: "Convolution"
  bottom: "conv33_data1"
  top: "conv34_data1_a"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv34_data1_b"
  type: "Convolution"
  bottom: "conv33_data1"
  top: "conv34_data1_b"
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0186339
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv34_data1"
  type: "Eltwise"
  bottom: "conv34_data1_a"
  bottom: "conv34_data1_b"
  top: "conv34_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "pool4_data1"
  type: "Pooling"
  bottom: "conv34_data1"
  top: "pool4_data1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv41_data1_a"
  type: "Convolution"
  bottom: "pool4_data1"
  top: "conv41_data1_a"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.020833334
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "conv41_data1_b"
  type: "Convolution"
  bottom: "pool4_data1"
  top: "conv41_data1_b"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.020833334
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "conv41_data1"
  type: "Eltwise"
  bottom: "conv41_data1_a"
  bottom: "conv41_data1_b"
  top: "conv41_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv42_data1_a"
  type: "Convolution"
  bottom: "conv41_data1"
  top: "conv42_data1_a"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.020833334
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "conv42_data1_b"
  type: "Convolution"
  bottom: "conv41_data1"
  top: "conv42_data1_b"
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.020833334
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "conv42_data1"
  type: "Eltwise"
  bottom: "conv42_data1_a"
  bottom: "conv42_data1_b"
  top: "conv42_data1"
  eltwise_param {
    operation: MAX
  }
}
layer {
  name: "conv42_data1_flatten"
  type: "Flatten"
  bottom: "conv42_data1"
  top: "conv42_data1_flatten"
}
layer {
  name: "conv42_data1_dropout"
  type: "Dropout"
  bottom: "conv42_data1_flatten"
  top: "conv42_data1_dropout"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "local4_data1"
  type: "InnerProduct"
  bottom: "conv42_data1_dropout"
  top: "local4_data1"
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "output"
  type: "Dropout"
  bottom: "local4_data1"
  top: "output"
  dropout_param {
    dropout_ratio: 0.5
  }
}
